# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSet..::..Erase Method
ViewSet Class See Also
---
Removes a specified view from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	View item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As View _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	View^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ViewThe view to be erased.
# ### Return Value
The number of views that were erased from the set.
# See Also
ViewSet Class
Autodesk.Revit.DB Namespace